org/computational_thinking.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-11-13 火 10:19 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>数理情報科学特論</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="suzuki@iwate-u.ac.jp 鈴木正幸，非常勤講師" />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="http://wiki.cis.iwate-u.ac.jp/~suzuki/org-html-theme/styles/sos/css/sos.css">
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/hideshow.css"/>
</head>
<body>
<div id="content">
<h1 class="title">数理情報科学特論</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org2f2ede7">1. このエッセイの目的</a></li>
<li><a href="#org7a74c61">2. 計算論的思考</a></li>
<li><a href="#orge4779ae">3. 計算手法と計算モデル</a></li>
<li><a href="#org5299046">4. 計算論的思考は機械知能の謎に挑む：</a></li>
<li><a href="#org8d6bf18">5. 計算論的思考は，すべての人にとって基本的な技術である．</a></li>
<li><a href="#org15418dd">6. 計算論的思考は</a></li>
<li><a href="#org0f14f85">7. 計算論的思考は一見難しそうな問題を我々がすでに解き方を知っている問題に変換する．</a></li>
<li><a href="#org9f4e949">8. 計算論的思考とは</a></li>
<li><a href="#org4a74212">9. 計算論的思考とは抽象化と分割統治を用いることである．</a></li>
<li><a href="#org68470d5">10. 計算論的思考とは予防，防御，そして最悪のシナリオからの復帰という観点を持ち，</a></li>
<li><a href="#org6ec257e">11. 計算論的思考はヒューリスティックな推論により解を発見することである．</a></li>
<li><a href="#org53333cb">12. 計算論的思考は超大量のデータを使って計算を高速化することである．</a></li>
<li><a href="#org87722a0">13. 私たちは計算論的思考が他の研究領域に与える影響を目撃してきた．</a>
<ul>
<li><a href="#orge9a7b7e">13.1. たとえば，機械学習は統計学を変えた．</a></li>
<li><a href="#org1ba56de">13.2. 計算生物学は生物学者の思考法を変えつつある．</a></li>
<li><a href="#org652fc63">13.3. 計算ゲーム理論は経済学者の思考法を，</a></li>
<li><a href="#orgac5bb7e">13.4. ナノコンピューティングは化学者の思考法を，</a></li>
<li><a href="#orgc75b8ff">13.5. そして量子計算は物理学者の思考法をそれぞれ変えつつある</a></li>
</ul>
</li>
<li><a href="#orgd25810c">14. それは何であり，何でないか</a></li>
<li><a href="#org267c6fb">15. 計算論的思考は誰のために</a></li>
</ul>
</div>
</div>
<p>
Jeannette M.Wing: COmputational Thinking,
COMM.ACM, Vol.49,No.3,pp33-35
</p>

<p>
computer scientist
Computational Thinking
情報処理 Vol.56 No.6 June 2015
翻訳
</p>

<p>
にゅあんすとしては，「情報処理的思考」が近いとの，訳者の弁。
</p>


<div id="outline-container-org2f2ede7" class="outline-2">
<h2 id="org2f2ede7"><span class="section-number-2">1</span> このエッセイの目的</h2>
<div class="outline-text-2" id="text-1">
<p>
すべての人が学びたい，そして使いたい，と考えるに違いない
一般的な態度とスキルに関するものである．
</p>
</div>
</div>

<div id="outline-container-org7a74c61" class="outline-2">
<h2 id="org7a74c61"><span class="section-number-2">2</span> 計算論的思考</h2>
<div class="outline-text-2" id="text-2">
<p>
は計算プロセスの能力と限界の上に成立しているもので，
</p>

<p>
計算の主体が人間であるか機械であるかは問わない．
</p>
</div>
</div>

<div id="outline-container-orge4779ae" class="outline-2">
<h2 id="orge4779ae"><span class="section-number-2">3</span> 計算手法と計算モデル</h2>
<div class="outline-text-2" id="text-3">
<p>
は，我々個人が単独では決して達成できないであろう問題を解決したリ，
</p>

<p>
システムをデザインしたりする勇気を与えてくれる．
</p>
</div>
</div>

<div id="outline-container-org5299046" class="outline-2">
<h2 id="org5299046"><span class="section-number-2">4</span> 計算論的思考は機械知能の謎に挑む：</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>人間がコンピュータより優れているのは何か？</li>

<li>コンピュータが人間より優れているのは何か？</li>

<li>何が計算可能か？ 
さらに最も根本的な問題</li>
</ul>

<p>
これらの問いに対して，我々はまだ部分的な回答しか知らない．
</p>
</div>
</div>

<div id="outline-container-org8d6bf18" class="outline-2">
<h2 id="org8d6bf18"><span class="section-number-2">5</span> 計算論的思考は，すべての人にとって基本的な技術である．</h2>
<div class="outline-text-2" id="text-5">
<p>
コンピュータ科学者だけではなく，すべての子供の分析的思考能力として，
「読み，書き，そろばん」のほかに計算論的思考を加えるべき
である．
</p>

<p>
コンピュータ科学と計算装置が計算論的思考を普及させることを忘れては
ならない．
</p>
</div>
</div>

<div id="outline-container-org15418dd" class="outline-2">
<h2 id="org15418dd"><span class="section-number-2">6</span> 計算論的思考は</h2>
<div class="outline-text-2" id="text-6">
<p>
基本的なコンピュータ科学の概念に基づく
</p>

<ul class="org-ul">
<li>問題解決，</li>
<li>システムのデザイン，</li>
<li>そして人間の理解,などを必要とする．</li>
</ul>

<p>
特定の問題を解くときに私たちは，
</p>

<ul class="org-ul">
<li>どれくらい難しいか？</li>
<li>最善の解決の道筋は何か？, などを考える．</li>
</ul>

<p>
コンピュータ科学はこれらの問いに正確に答えるための確固とした理論
の上に構築されている．
</p>

<p>
問題の難しさを述べるためには
</p>

<ul class="org-ul">
<li>その土台となる機械̶問題の解決策を探る計算装置─の能力を知らねばならない．</li>

<li>機械の命令セット，計算資源の制約，動作環境などを考慮しなければな
らない．</li>
</ul>

<p>
問題を効率良く解くためにはさらに次のことを考慮せねばならない．
</p>

<ul class="org-ul">
<li>近似解で良いのか，</li>

<li>乱数化をうまく利用できるのか，</li>

<li>また解の判定に偽陽性や偽陰性が許されるのか，</li>
</ul>
</div>
</div>

<div id="outline-container-org0f14f85" class="outline-2">
<h2 id="org0f14f85"><span class="section-number-2">7</span> 計算論的思考は一見難しそうな問題を我々がすでに解き方を知っている問題に変換する．</h2>
<div class="outline-text-2" id="text-7">
<p>
これには簡略化，埋込，変換，シミュレーションなどが使えるだろう．
</p>
</div>
</div>

<div id="outline-container-org9f4e949" class="outline-2">
<h2 id="org9f4e949"><span class="section-number-2">8</span> 計算論的思考とは</h2>
<div class="outline-text-2" id="text-8">
<ul class="org-ul">
<li>再帰的に考えることであり，</li>
<li>並列処理であり，</li>
<li>命令をデータとし，</li>
<li>データを命令とする, ことである．</li>
</ul>

<p>
それはプログラムを正しさと効率からだけではなく，美学的基準や，シス
テムデザインの単純さと洗練度からも判断することである．
</p>
</div>
</div>

<div id="outline-container-org4a74212" class="outline-2">
<h2 id="org4a74212"><span class="section-number-2">9</span> 計算論的思考とは抽象化と分割統治を用いることである．</h2>
<div class="outline-text-2" id="text-9">
<p>
問題点の分割である．
</p>

<ul class="org-ul">
<li>巨大で複雑なタスクに挑戦したり，</li>
<li>巨大で複雑なシステムをデザインしたりするときに，</li>
</ul>

<p>
問題の適切な表現法を選ぶことであり，問題を解きやすくするため
に問題の適切な側面だけをモデル化することである．
</p>

<p>
不変項を見つけてシステムの振舞いを簡潔かつ宣言的に記述することであ
る．
</p>

<p>
すべての細部にわたり理解することなく巨大複雑系を使いこなし，変更し，
影響を与えることが自信を持ってできることである．
</p>

<p>
複数のユーザに備えてサブシステムをモジュール化したり，
</p>

<p>
将来の利用に備えてデータをプリフェッチしたりキャッシュしたりするこ
とである．
</p>
</div>
</div>

<div id="outline-container-org68470d5" class="outline-2">
<h2 id="org68470d5"><span class="section-number-2">10</span> 計算論的思考とは予防，防御，そして最悪のシナリオからの復帰という観点を持ち，</h2>
<div class="outline-text-2" id="text-10">
<p>
そのために冗長性，故障封じ込め，誤り訂正などを用いることである．
</p>

<p>
それはグリッドロック（超渋滞），デッドロックを判定し，コントラクトインタフェースを
起動することである．
</p>

<p>
それは会議を設定するときに競合条件の回避を行うことを学ぶことである．
</p>
</div>
</div>

<div id="outline-container-org6ec257e" class="outline-2">
<h2 id="org6ec257e"><span class="section-number-2">11</span> 計算論的思考はヒューリスティックな推論により解を発見することである．</h2>
<div class="outline-text-2" id="text-11">
<ul class="org-ul">
<li>それは不確定な状況でのプランニング，学習，スケジューリングのことである．</li>
<li>それは探索して，探索して，そしてさらに探索してWebページのリストや，
ゲームに勝つ戦略や，あるいは反例を見つけることである．</li>
</ul>
</div>
</div>

<div id="outline-container-org53333cb" class="outline-2">
<h2 id="org53333cb"><span class="section-number-2">12</span> 計算論的思考は超大量のデータを使って計算を高速化することである．</h2>
<div class="outline-text-2" id="text-12">
<ul class="org-ul">
<li>それは時間と空間のトレードオフ，あるいは計算パワーと記憶容量のト
レードオフをすることである．</li>
</ul>
</div>
</div>

<div id="outline-container-org87722a0" class="outline-2">
<h2 id="org87722a0"><span class="section-number-2">13</span> 私たちは計算論的思考が他の研究領域に与える影響を目撃してきた．</h2>
<div class="outline-text-2" id="text-13">
</div>
<div id="outline-container-orge9a7b7e" class="outline-3">
<h3 id="orge9a7b7e"><span class="section-number-3">13.1</span> たとえば，機械学習は統計学を変えた．</h3>
<div class="outline-text-3" id="text-13-1">
<p>
 統計的学習は，ほんの数年前には
考えられなかったような，データ量と次元の巨大な問題に適用された．す
べての組織の統計部門はコンピュータ科学者を採用し始めた．コンピュー
タ科学の学部では統計学科をすでに擁立していない場合には，新しく設立
している．
</p>
</div>
</div>

<div id="outline-container-org1ba56de" class="outline-3">
<h3 id="org1ba56de"><span class="section-number-3">13.2</span> 計算生物学は生物学者の思考法を変えつつある．</h3>
<div class="outline-text-3" id="text-13-2">
<p>
コンピュータ科学者の生物学に対する貢献は，単に大量のゲノムシーケン
スデータから特定のパターンを見つけ出すことにとどまらない．
</p>

<p>
データ構造とアルゴリズムという，我々の持つ計算的抽象化と方法論が，
タンパク質の構造を，構造から機能が明らかになるような形で表現できる
ことが期待されている．
</p>
</div>
</div>

<div id="outline-container-org652fc63" class="outline-3">
<h3 id="org652fc63"><span class="section-number-3">13.3</span> 計算ゲーム理論は経済学者の思考法を，</h3>
</div>
<div id="outline-container-orgac5bb7e" class="outline-3">
<h3 id="orgac5bb7e"><span class="section-number-3">13.4</span> ナノコンピューティングは化学者の思考法を，</h3>
</div>
<div id="outline-container-orgc75b8ff" class="outline-3">
<h3 id="orgc75b8ff"><span class="section-number-3">13.5</span> そして量子計算は物理学者の思考法をそれぞれ変えつつある</h3>
<div class="outline-text-3" id="text-13-5">
<p>
このような思考法は他分野の科学者だけでなくすべての人に必要な技量の1
つである．ユビキタスコンピューティングが今日にもたらした影響と同様
のものを，計算論的思考が明日にもたらす．ユビキタスコンピューティン
グは昨日の夢が今日の現実となったものであり，計算論的思考は明日の現
実である．
</p>

<p>
コンピュータ科学者のように考えるということは，コンピュータをプログ
ラムできるということ以上の意味を持つ．複数のレベルの抽象思考が必要
である
</p>
</div>
</div>
</div>

<div id="outline-container-orgd25810c" class="outline-2">
<h2 id="orgd25810c"><span class="section-number-2">14</span> それは何であり，何でないか</h2>
<div class="outline-text-2" id="text-14">
<p>
コンピュータ科学とは
</p>

<ul class="org-ul">
<li>計算可能性と,</li>
<li>計算方式の，学問である．</li>
</ul>

<p>
したがって計算論的思考は以下の特徴を持つ：
</p>

<p>
─ 概念化のことであり，プログラミングではない．
</p>

<p>
それは複数の抽象レベルで考えることを要求する．
</p>

<p>
─ 基礎的な技能であり，機械的なものではない．
</p>

<p>
この基礎的な技能は，現代社会で活動するためにすべての人が知らねば
ならないものである．機械的というのはルーチンワークのことである．
皮肉なことに，コンピュータが人間のように考えるというAIのグランド
チャレンジをコンピュータ科学が解決するまでは，思考は機械的である．
</p>

<p>
─ 人間の思考法のことであり，コンピュータのそれではない．
</p>

<p>
計算論的思考は人間の問題解決法であり，人間がコンピュータのように
考えることを目指すものではない．コンピュータは単調で退屈であるが，
人間は賢くて想像力豊かである．人間がコンピュータを刺激的なものに
する．コンピュータという計算装置を持つことにより，我々は計算の時
代以前には挑戦できなかったような問題を解くのに自らの叡智を使うこ
とができ，新しいシステムを構築することができる．限界は我々の想像
力だけである．
</p>

<p>
─ 数学的思考と工学的思考を組み合わせ，補完することである．
</p>

<p>
コンピュータ科学は本質的に数学的思考の上に成立している．
</p>

<p>
そのため，すべての科学同様，コンピュータ科学の形式的基礎は数学に
ある．
</p>

<p>
コンピュータ科学は，実世界と相互作用するシステムを構築する場合，
本質的に工学的思考の上に成立している．
</p>

<p>
それらを司る計算装置の制約が，コンピュータ科学者に数学的だけでは
なく計算論的な思考を要求する．仮想世界を自由に構築できるため，物
理世界の制約を超えたシステムの構成が可能である．
</p>

<ul class="org-ul">
<li><p>
概念であり，モノではない．
</p>

<p>
我々が創造するものは単なるソフトウェアやハードウェアという，物理
的にどこにでも存在し，いつでも触れることのできるモノではなく，問
題に迫り解決するための計算論的な概念で，我々の日常生活を助け，他
の人々とコミュニケーションをとり交流するためのものである；そして
</p></li>

<li>それは，すべての人にどこでも．計算論的思考は，人間の努力と一体化
してしたときに現実となり，明示的に哲学する必要性は消えてしまう．</li>
</ul>

<p>
計算論的思考は，この分野に対する社会通念を変えようとするコンピュータ科
学の教育者，研究者，そして実務家を導く主要な観点である．
</p>

<p>
特に，大学入学前の学生とその教師や親たちを含む人々に対し，以下の2つの
メッセージを送る必要がある：
</p>

<p>
─ 知的に挑戦的で魅力的な科学的問題が多く残されている．問題領域と解決
  策領域を限定しているのは我々の好奇心と創造性だけである；そして
</p>

<p>
─ コンピュータ科学を専攻した学生は何を専門にしてもよい．英語や数学を
  専攻した学生は異なる分野で複数のキャリアを追求しているではないか．
</p>

<p>
コンピュータ科学もしかり．コンピュータ科学を専攻した後に医学，法律，
経営，政治，そしてあらゆる種類の科学や工学，さらには芸術の分野に進
むことができる．
</p>
</div>
</div>

<div id="outline-container-org267c6fb" class="outline-2">
<h2 id="org267c6fb"><span class="section-number-2">15</span> 計算論的思考は誰のために</h2>
<div class="outline-text-2" id="text-15">
<p>
コンピュータ科学の教授は「コンピュータ科学者のように考える方法」と名付
けた科目を，大学の新入生に教えるべきである．
</p>

<p>
そしてそれはコンピュータ科学専門の学生だけでなく他学科の学生たちにも開
放すべきである．
</p>

<p>
大学以前の学生にも計算手法やモデルに触れる機会を作るべきである．
</p>

<p>
コンピュータ科学に不満を述べたり，それに対する興味を否定するのではなく，
あるいはコンピュータ科学の研究費を却下したりしないで，一般の人々の興味
をこの分野の知的冒険へと導くべきである．
</p>

<p>
そのようにしてコンピュータ科学の喜び，恐怖，威力を広め，計算論的思考を
一般的なものにしたい．
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: suzuki@iwate-u.ac.jp 鈴木正幸，非常勤講師</p>
<p class="date">Created: 2018-11-13 火 10:19</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
